charliejgallo/ESP32S3_AmoledOS/sdkconfig.defaults
# ---------------------------------------------------------------------------
# AmoledOS - Waveshare ESP32-S3-Touch-AMOLED-1.8 (v1 y v2)
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# Flash 16 MB en QIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM octal a 80 MHz. Ejecutar instrucciones y rodata desde PSRAM nos deja
# mucha mas RAM interna libre para LVGL y para las apps dinamicas.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# NO ejecutar desde PSRAM. Copiar el codigo y la rodata a PSRAM parece buena
# idea, pero pone las instrucciones y el buffer de dibujo de LVGL a pelear por
# el mismo bus octal: cada pixel escrito frena la busqueda de instrucciones.
# Ejecutando desde flash por cache (QIO 80 MHz) la PSRAM queda entera para los
# datos, que es lo que mas la necesita.
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=n
CONFIG_SPIRAM_RODATA=n
CONFIG_SPIRAM_USE_MALLOC=y
# Equilibrio: lo chico se queda adentro (rapido), lo grande va a PSRAM. Con
# 1024 hasta los buffers de trabajo de LVGL caian en PSRAM y el dibujo sufria.
# Se probo subirlo a 65536 para llevar los canvas de las apps a RAM interna: no
# cambio el FPS en nada, asi que vuelve al valor conocido.
# Umbral por debajo del cual malloc() usa siempre RAM interna. Bajarlo empuja
# mas reservas a PSRAM y libera interna, que es el recurso escaso: de ahi sale
# el .text de las apps dinamicas. Lo que necesita DMA lo pide explicito y no se
# ve afectado.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Proteccion de memoria: APAGADA a proposito ------------------------------
# Viene activada por defecto y parte la SRAM en un tramo de instrucciones
# (lectura+ejecucion) y otro de datos (lectura+escritura). Con eso el heap NO es
# ejecutable y heap_caps_malloc(MALLOC_CAP_EXEC) devuelve cero siempre: medido,
# "ejecutable 0 B". Es incompatible de raiz con cargar codigo en tiempo de
# ejecucion, que es el punto de este firmware.
# Lo que se pierde: el panic automatico cuando algo ejecuta datos o escribe
# sobre el codigo. Lo que se gana: que las apps dinamicas existan.
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=n

# LVGL cede su IRAM (25 KB) al codigo de las apps. Con el firmware ejecutando
# desde flash por cache esto ya casi no se nota: antes importaba mucho porque
# lo que quedaba fuera de IRAM caia en PSRAM, que si es lenta para instrucciones.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n

# Medidor de cuadros por segundo y uso de CPU. PERF_MONITOR depende de SYSMON:
# sin este, la opcion se ignora en silencio.
CONFIG_LV_USE_SYSMON=y
# CONFIG_LV_USE_PERF_MONITOR is not set
# Arriba a la izquierda lo comia la esquina redondeada del panel.
CONFIG_LV_PERF_MONITOR_ALIGN_TOP_MID=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_FREERTOS_HZ=1000
# (main task stack: see the RAM audit block at the end, 10240)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Consola por el USB-Serial/JTAG del Type-C
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- LVGL ---------------------------------------------------------------
CONFIG_LV_USE_STDLIB_MALLOC_LV_STDLIB_CLIB=y
# Las Montserrat de LVGL estan APAGADAS: son solo ASCII y las reemplazan
# las aos_montserrat_* de components/aos_fonts, que llegan hasta Latin-1.
# La fuente por defecto del tema tiene que apuntar a algo que no sea una
# Montserrat, porque cada opcion de esa lista hace 'select' de la suya y la
# vuelve a prender. Quien manda de verdad es el -DLV_FONT_DEFAULT de
# components/aos_fonts/aos_fonts.cmake, asi que la unscii nunca se referencia
# y no llega a linkearse.
CONFIG_LV_FONT_DEFAULT_UNSCII_8=y
# CONFIG_LV_FONT_MONTSERRAT_14 is not set
# CONFIG_LV_FONT_MONTSERRAT_16 is not set
# CONFIG_LV_FONT_MONTSERRAT_20 is not set
# CONFIG_LV_FONT_MONTSERRAT_28 is not set
# CONFIG_LV_FONT_MONTSERRAT_36 is not set
# CONFIG_LV_FONT_MONTSERRAT_48 is not set
# Captura de pantalla por /api/captura: la unica forma de ver desde afuera lo
# que el log no cuenta -un glifo que falta, texto que se sale, dos cosas
# encimadas-. Solo agrega su propio modulo; no toca ninguna estructura
# compartida con las apps.
CONFIG_LV_USE_SNAPSHOT=y
# Filesystem 'A:' para el visor de fotos y para cargar recursos de las apps
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=65
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_BMP=y
# QR de la pantalla del punto de acceso: el telefono se conecta escaneandolo en
# lugar de tipear la clave. Es qrcodegen, que ya viene en el arbol de LVGL, con
# su propio widget; no toca ninguna estructura compartida con las apps.
CONFIG_LV_USE_QRCODE=y
# Los demos y ejemplos de LVGL arrastran cientos de KB de imagenes y, al
# exportar sus simbolos a las apps dinamicas, terminan linkeados si o si.
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# --- Cargador de apps dinamicas ----------------------------------------
CONFIG_ELF_LOADER=y
CONFIG_ELF_DYNAMIC_LOAD_SHARED_OBJECT=y
CONFIG_ELF_FILE_SYSTEM_BASE_PATH="/sdcard"
# NO cargar el ELF en PSRAM. En el S3, con BUS_ADDRESS_MIRROR (el default del
# chip), el cargador reserva el .text con MALLOC_CAP_SPIRAM -> direccion del bus
# de datos, y las entradas de su tabla de simbolos no pasan por
# elf_remap_text(): dlsym devuelve punteros no ejecutables y saltar ahi es un
# InstructionFetchError. Ademas el mapeo de instrucciones a PSRAM lo arma el
# arranque para el codigo del firmware, no para memoria del heap.
# Sin esta opcion el .text va a RAM interna ejecutable (MALLOC_CAP_EXEC).
CONFIG_ELF_LOADER_LOAD_PSRAM=n
CONFIG_ELF_LOADER_LIBC_SYMBOLS=y
CONFIG_ELF_LOADER_ESPIDF_SYMBOLS=y
CONFIG_ELF_LOADER_CUSTOMER_SYMBOLS=y
# OJO CON EL NOMBRE: no es "cuantos simbolos", es cuantas TABLAS de simbolos se
# pueden registrar (g_symbol_tables en esp_elf.c es un array de PUNTEROS a
# tabla). Estaba en 4096 -el tope del rango-, seguramente leyendolo como "los
# 2373 simbolos de aos_symbols.c entran holgados": eran 16 KB de RAM INTERNA
# llenos de punteros nulos que nadie usa nunca, porque el firmware exporta su
# tabla por ESP_ELFSYM_EXPORT y no llama a esp_elf_register_symbol ni una vez.
CONFIG_ELF_LOADER_NUMBER_SYMBOLS=4

# --- BSP ----------------------------------------------------------------
# El BSP pide el buffer de LVGL sin marcarlo apto para DMA, asi que cae en
# PSRAM y el driver SPI se arma una copia interna del tamano de la transferencia.
# Con 120 lineas eso son 88 KB de RAM interna que no existen. Con 24 son 17 KB.
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=24
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=n
CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL=y

