charliejgallo/ESP32S3_AmoledOS/sdkconfig.defaults
# --- USB (branch usb, docs/USB.md) --------------------------------------------
# The port is the console at boot in every build. These only make the CDC
# class available to aos_usb for device mode; nothing is installed until
# /api/usb?mode=device (later Settings) asks for it.
CONFIG_TINYUSB_CDC_ENABLED=y
# Disk mode (D2): the MSC class, with the largest endpoint buffer the S3
# allows (8 KB of static internal RAM). Measured 2026-09-12: 512 B (the
# default) writes at 74 KB/s; docs/USB.md T5 has the 8 KB figures.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192
# D3: one HID interface (keyboard + consumer control) in device mode.
CONFIG_TINYUSB_HID_COUNT=1
# The suspend and resume events, logged: after the Mac's sleep the network
# died while the keyboard lived (2026-09-13); the log has to say what the bus did.
CONFIG_TINYUSB_SUSPEND_CALLBACK=y
CONFIG_TINYUSB_RESUME_CALLBACK=y
# D7: a MIDI port beside the keyboard and the network.
CONFIG_TINYUSB_MIDI_COUNT=1
# D6: the watch as a network interface of the computer (CDC-NCM), the portal
# at http://192.168.7.1 over the cable.
CONFIG_TINYUSB_NET_MODE_NCM=y
# One NTB each way of 2 KB (a frame is 1514 B): the class keeps them static
# in internal RAM whether the interface is up or not, and the defaults (3 x
# 3200 B each way) took 19 KB from the pool the apps' code comes from.
CONFIG_TINYUSB_NCM_OUT_NTB_BUFFS_COUNT=1
CONFIG_TINYUSB_NCM_IN_NTB_BUFFS_COUNT=1
CONFIG_TINYUSB_NCM_OUT_NTB_BUFF_MAX_SIZE=2048
CONFIG_TINYUSB_NCM_IN_NTB_BUFF_MAX_SIZE=2048
CONFIG_TINYUSB_DEBUG_LEVEL=1
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="AmoledOS"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="AmoledOS watch"
# Core dumps to the coredump partition (branch usb): the only way to see a
# panic while the USB port is on the OTG side. Read with idf.py coredump-info.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
# A panic is printed on the console AND written to the coredump partition
# (docs/USB.md): with the USB port on the OTG side the console is not there,
# and the dump is what is left; on the console the print is what a developer
# reads first. The Serial-JTAG print has a timeout per character, it never
# hangs. The branch ran silent for its tests; main prints.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# mDNS: the board has no Ethernet, and its predefined interface took the
# third of the three slots; the USB network interface (D6) needs one so
# amoledos.local answers over the cable too.
CONFIG_MDNS_PREDEF_NETIF_ETH=n

# FTM (fine timing measurement) for the radar between two watches (docs/LINK.md)
CONFIG_ESP_WIFI_FTM_ENABLE=y

# The panel commands from other cores run on the IPC task of the panel's core (aos_hal_esp32.c panel_tx_on_core)
CONFIG_ESP_IPC_TASK_STACK_SIZE=2560
